//新建
[NewDocumentForm]
groupBox2  =  "屏幕属性"
label7  =  "屏幕尺寸"
label4  =  "图片像素"
groupBox4  =  "存储路径"
label6  =  "提示："
label5  =  "如果选择的路径下已经存在工程文件\r\n则直接打开已存在的工程文件\r\n"
Text  =  "屏幕属性设置"
btOk  =  "确定"
btCancel  =  "取消"


//编辑区域
[cfg_DrawAreaForm]
toolStripMenuItem1  =  "对齐"
toolStripMenuItem2  =  "相同"
toolStripMenuItem3  =  "复制  Ctrl+C"
toolStripMenuItem4  =  "粘贴  Ctrl+V"
toolStripMenuItem5  =  "删除  Del"
toolStripMenuItem6  =  "撤销  Ctrl+Z"
toolStripMenuItem7  =  "置前"
toolStripMenuItem8  =  "置后"
toolStripMenuItem9  =  ""
toolStripMenuItem10  =  "放大"
toolStripMenuItem11  =  "缩小"
toolStripMenuItem12  =  "全选"
toolStripMenuItem13  =  "同类型全选"
toolStripMenuItem14 =  ""
toolStripMenuItem15 =  ""
toolStripMenuItem16 =  ""
toolStripMenuItem17 =  ""
toolStripMenuItem18 =  ""
toolStripMenuItem19 =  ""
toolStripMenuItem20  =  "左对齐"
toolStripMenuItem21  =  "居中对齐"
toolStripMenuItem22  =  "右对齐"
toolStripMenuItem23  =  "上对齐"
toolStripMenuItem24  =  "中间对齐"
toolStripMenuItem25  =  "底部对齐"
toolStripMenuItem26  =  "等宽"
toolStripMenuItem27  =  "等高"
toolStripMenuItem28  =  "大小相等"
toolStripMenuItem29 =  ""
toolStripMenuItem30 =  ""
toolStripMenuItem31 =  ""
toolStripMenuItem32 =  ""
toolStripMenuItem33 =  ""
toolStripMenuItem34 =  ""
toolStripMenuItem35 =  ""
toolStripMenuItem36 =  ""
toolStripMenuItem37 =  ""
toolStripMenuItem38 =  ""
toolStripMenuItem39 =  ""
toolStripMenuItem40 =  ""
toolStripMenuItem41 =  ""
toolStripMenuItem42 =  ""
toolStripMenuItem43 =  ""
toolStripMenuItem44 =  ""
toolStripMenuItem45 =  ""
toolStripMenuItem46 =  ""
toolStripMenuItem47 =  ""
toolStripMenuItem48 =  ""
toolStripMenuItem49 =  ""
toolStripMenuItem50 =  ""

//主菜单
[FormMain]             
tabPage1 = "文件"  
myButton1 = "新建"  
myButton2 = "打开"  
myButton3 = "保存"  
myButton4 = "另存为"  
myButton5  = "生成"  
myButton6  = "关闭"            
myButton7  = "导出"  
myButton8  = "导入"  
myButton126="配网"
myButton127="停止配网"

tabPage13="常用控件"      
myButton61  = "新建"  
myButton65  = "保存"  
myButton64  = "生成"  
myButton62  = "导入"  
myButton96  = "查看变量"  
myButton95  = "当前页开始预览"  
myButton94  = "首页开始预览"      
myButton98  = "分辨率设置"  
myButton97  = "DGUS 串口工具"   
myButton81  = "变量图标显示"  
myButton80  = "动画图标显示"           
myButton79  = "滑动刻度显示"     
myButton78  = "艺术字变量"  
myButton77  = "图片动画"  
myButton76 = "图标旋转指示"
myButton75 = "位变量图标"
myButton74 = "数据变量"
myButton73 = "文本显示"
myButton72 = "表盘时钟"
myButton71 = "文本RTC显示"
myButton70 = "基本图形显示"
myButton112 = "特殊行业应用"
myButton68 = "二维码"
myButton67 = "区域滚屏显示"
myButton66 = "数据窗口显示"
myButton107 = "动态曲线"
myButton93 = "数据录入"
myButton92 = "弹出菜单"
myButton90 = "增量调节"
myButton82 = "拖动调节"
myButton91 = "基础触控"
myButton88 = "按键返回"
myButton87 = "文本录入"
myButton108 = "汉字录入"
myButton89 = "硬件参数"
myButton86  = "数据返回"  
myButton85  = "转动调节"  
myButton84  = "滑动调节"  
myButton83  = "手势翻页"        
myButton110  = "亮度调节"  
myButton102  = "复制"     
myButton101  = "粘贴"         
myButton100  = "删除"     
myButton104  = "置前"  
myButton103  = "置后"  
myButton99  = "撤销"   
        
tabPage3  = "图标显示"   
myButton9  = "变量图标显示"        
myButton10  = "动画图标显示"  
myButton11  = "滑动刻度显示"  
myButton12  = "艺术字变量"  
myButton13  = "图片动画"  
myButton14  = "图标旋转指示"  
myButton15  = "位变量图标"  
myButton18  = "表盘时钟"  
myButton21  = "数据变量传递"  
myButton115  = "DGUSII文本显示"  
myButton116  = "图标页面平移"  
myButton118  = "图标叠加"  
myButton119  = "批量图标"  
myButton121  = "GTF图标"  
myButton123  = "数字视频"  

tabPage14  = "文本显示"  
myButton16  = "数据变量"  
myButton17  = "文本显示"  
myButton19  = "文本RTC显示"  
myButton114  = "HEX数据显示"  
myButton113  = "文本滚屏显示"  
myButton24  = "数据窗口指示"  
myButton120  = "滚字轮显示"  

tabPage15  = "图形显示"  
myButton105  = "动态曲线"  
myButton20  = "基本图形显示"  
myButton23  = "区域滚屏显示"  
myButton22  = "二维码"  
myButton109  = "区域亮度调节"  
myButton129  = "进度条" 

tabPage2 ="触控控件"
myButton25= "数据录入"
myButton26= "弹出菜单"
myButton27= "增量调节"
myButton28= "拖动调节"
myButton29= "基础触控"
myButton30= "按键返回"
myButton31= "文本录入"
myButton32= "硬件参数"
myButton33= "数据返回"
myButton34= "转动调节"
myButton35= "滑动调节"
myButton36= "手势翻页"
myButton117= "滑动图标选择"
myButton124= "位按钮"
myButton106= "汉字录入"

tabPage4= "显示布局"
myButton37= "左对齐"
myButton38= "居中对齐"
myButton39= "右对齐"
myButton40= "上对齐"
myButton41= "中间对齐"
myButton42= "底部对齐"
myButton43= "大小相等"
myButton44= "等宽"
myButton45= "等高"
myButton46= "复制"
myButton47= "粘贴"
myButton48= "删除"
myButton49= "撤销"
myButton52= "置前"
myButton53= "置后"
myButton125= "阵列"
 
tabPage6= "设置"
myButton57= "分辨率设置"
myButton58= "DGUS 串口工具"
myButton128= "竖屏" 

tabPage5 ="显示"
myButton54 ="查看变量"
myButton55 ="当前页开始预览"
myButton56 ="首页开始预览"
btnDebug ="调试助手"

string_1 = 是否保存当前工程！如不保存,您修改的设置将丢失
string_2 = 提示
string_3 = 请先打开或新建一个工程


//列表
[DummyTaskList]
toolStripButton5 = "增加"
toolStripButton5_ToolTipText = "增加"   
toolStripDropDownButton2 = "删除"
删除ToolStripMenuItem = "删除选中"
删除ToolStripMenuItem_ToolTipText = "删除选中"
删除所有ToolStripMenuItem = "删除所有"
删除所有ToolStripMenuItem_ToolTipText = "删除所有"
toolStripButton6 = "上移"
toolStripButton7 = "下移"
Position = "位置"
Column1 = "文件"

string_1 = 请先打开或新建一个工程！
string_2 = 文件名:请指定新的文件名，以确保文件名不重复
string_3 = 文件重命名

//欢迎
[DGUS_Welcome]
linkLabel1  = "新建工程" 
linkLabel2  = "打开工程"  
groupBox2  = "工程管理"  
linkLabel12  = "历史"   
groupBox3  = "DGUS 配置工具"   
linkLabel6  = "串口下载工具"   
linkLabel10  = "图片转换"     
linkLabel3  = "DWIN ICL 生成工具"    
linkLabel4  = "0 号字库生成工具"   
linkLabel5  = "Do you know?"    
groupBox1  = "帮助"    
linkLabel9  = "免费热线 : 400-018-9008"      
linkLabel7  = "Web: www.dwin.com.cn"  
groupBox5  = "预定义参数" 
label1  = "每页最大配置变量数"     
label8  = "ICON 显示模式"         
CK_AutoData  = "数据自动上传"        
groupBox4  = "字体"       
label3  = "字体颜色(0x)"
label15  = "字库位置"   
label11  = "字体大小"    
TabText  = "欢迎使用"

label4="OS版本信息"
linkLabel14="配置文件生成工具"
linkLabel13="WAE 生成工具"
linkLabel15="16级灰度字库生成工具"
linkLabel16="网络通讯设置"
link_Keyboard="组态键盘工具"
link_RoleChar="UIC滚字轮"
link_DGUS_Font="DGUS字库"
comboBox3_item0="版本低于V21"
comboBox3_item1="版本高于V21"
comboBox1_item0="透明"
comboBox1_item1="显示背景"
label2="【No.0 Font Library】:It generates the No.0 font profile for DWIN DGUS.No.0 Font which included the matrix font in different size as below:4*8 - 64*128"

[DGUS_Design]
TabText  = "触控及变量配置"

[Btn_PropertyFrom]
label2 =  "显示"
ComboBox1String_1 = 所有
ComboBox1String_2 = 仅显示触控配置
ComboBox1String_3 = 仅显示变量配置
checkBox3 =  "得到图片RGB值(0x)"
checkBox1 =  "在配置按钮上显示文字"
groupBox1 =  "快速配置（复制选中配置按钮）"
button1 =  "确定"
label3 =  "配置数量"
label1 =  "变量地址增量"
groupBox3 =  "组合配置"
button7 =  "滑动配置"
button6 =  "RTC 配置"
button4 =  "文本录入"
button3 =  "数据录入"
button8 = "选定触控语音ID修改"
groupBox2 =  "网格控制"
label8 =  "网格颜色"
label7 =  "网格密度"
label6 =  "Y方向偏移量"
label5 =  "X方向偏移量"  
checkBox2 =  "显示网格"
groupBox4 =  "快速操作"
button5 =  "属性修改"
label9 =  "批量选中:"
ComboBox2String_1 = 变量数据录入
ComboBox2String_2 = 弹出菜单
ComboBox2String_3 = 增量调节
ComboBox2String_4 = 拖动调节
ComboBox2String_5 = 滑动条件
ComboBox2String_6 = 基础触控
ComboBox2String_7 = 按键返回
ComboBox2String_8 = 文本录入
ComboBox2String_9 = 滑动翻页
ComboBox2String_10 = 变量图标显示
ComboBox2String_11 = 动画图标显示
ComboBox2String_12 = 滑动刻度指示
ComboBox2String_13 = 艺术字变量显示
ComboBox2String_14 = 图片动画显示
ComboBox2String_15 = 图标旋转指示
ComboBox2String_16 = 位变量图标显示
ComboBox2String_17 = 数量变量显示
ComboBox2String_18 = 文本显示
ComboBox2String_19 = 表盘时钟显示
ComboBox2String_20 = 文本RTC显示
ComboBox2String_21 = 数据窗口
ComboBox2String_22 = 区域滚屏
ComboBox2String_23 = 二维码显示
ComboBox2String_24 = 区域亮度调节
ComboBox2String_25 = DGUSII文本显示
button2 =  "选择所有"
TabText =  "属性"
string_1 = 请选择一个或多个相同类型的按钮！
string_2 = 不是同一类型的按钮不能批量设置
string_3 = 不支持批量设置！

label11="调整值"
button9="全部增加"
button10="全部减少"
strInfo="点击确定后，所有控件的变量地址将变为原地址加上调整量（变量地址为0的除外），点击取消，则不调整！"
strInfo2="点击确定后，所有控件的变量地址将变为原地址减去调整量（减小后变量地址为0的除外），点击取消，则不调整！"
checkBox4="锁定"
checkBox5="解除锁定"
myGroupBox1="变量地址调整"
btnAddSelect="增加选中"
btnSubSelect="减少选中"

//图标变量
[ICOvariableForm]
label9  =  "描述指针(0x)"
label16  =  "名称定义"
label8  =  "显示模式"
label7  =  "图标文件"
label5  =  "对应的图标"
label6  =  "对应的图标"
label4  =  "变量上限"
label3  =  "变量下限"
label2  =  "变量地址(0x)"
label19  =  "初始值"
Text  =  "图标变量"
comboBox1String_1 =  "透明"
comboBox1String_2 =  "显示背景"

label10="背景显示模式"
label13="背景亮度"
label14="图标亮度"
label15="背景色滤除强度"
cb2_item0="覆盖背景图片"
cb2_item1="背景图片叠加模式 1"
cb2_item2="背景图片叠加模式 2"
cbox_popshow="在弹出菜单中显示"

//动画图标显示  
[Anim_DisICOForm]
comboBox1String_1 = "透明"
comboBox1String_2 = "显示背景"
label16  =  "名称定义"
label8  =  "显示模式"
label7  =  "图标文件"
label4  =  "开始值"
label3  =  "停止值"
label2  =  "变量地址(0x)"
label1  =  "描述指针(0x)"
label9  =  "结束图标ID"
label5  =  "开始图标ID"
label6  =  "停止图标ID"
label10  =  "初始值"
Text  =  "动画显示设置"

label12="单个图标显示时间(单位：DGUS周期)"
label11="背景显示模式"
label13="背景亮度"
label15="图标亮度"
label14="动画显示模式"
label17="背景色滤除强度"
label18="停止图标"
cb2_item0="覆盖背景图片"
cb2_item1="背景图片叠加模式 1"
cb2_item2="背景图片叠加模式 2"
cb3_item0="循环播放"
cb3_item1="单次播放"
cb4_item0="不复位"
cb4_item1="复位"
cb4_item2="停在当前图标"

//滑动刻度指示设置
[SliderSetForm]
label10  =  "终止刻度坐标"
LableA  =  "起始和终止刻度坐标，系统自动默认为配置按钮的区域范围"
label13  =  "变量类型"
label6  =  "(X)坐标前移偏移量"
label4  =  "图标显示(Y)坐标值"
label8  =  "显示模式"
label7  =  "图标文件"
label5  =  "滑动图标"
label14  =  "描述指针(0x)"
label9  =  "终止变量刻度值"
label16  =  "名称定义"
label3  =  "起始变量刻度值"
label2  =  "变量地址(0x)"
label15  =  "初始值"
label12 = "刻度模式"
Text  =  "滑动刻度指示设置"
comboBox1String_1 =  "透明"
comboBox1String_2 =  "显示背景"
comboBox2String_1 =  "横向刻度条"
comboBox2String_2 =  "纵向刻度条"
comboBox3String_1 =  "指向一个整型变量"
comboBox3String_2 =  "指向高字节数据"
comboBox3String_3 =  "指向低字节数据"
String_1 =  "图标显示(Y)坐标值"
String_2 =  "(X)坐标前移偏移量"
String_3 =  "图标显示(X)坐标值"
String_4 =  "(Y)坐标前移偏移量"

label18="背景显示模式"
label17="背景亮度"
label19="图标亮度"
label20="背景色滤除强度"
cb4_item0="覆盖背景图片"
cb4_item1="背景图片叠加模式 1"
cb4_item2="背景图片叠加模式 2"

//艺术字变量显示
[ArtTextSetForm]
label9  =  "0对应的ICON_ID, 排列顺序为0123456789-."
label1  =  "对齐方式"
label13  =  "变量类型"
label6  =  "整数位数"
label8  =  "显示模式"
label5  =  "小数位数"
label11  =  "起始图标"
label12  =  "名称定义"
label14  =  "图标文件"
label15  =  "变量地址(0x)"
label17  =  "描述指针(0x)"    
label10  =  "初始值"
TabText  =  "艺术字变量显示"
label3="背景显示模式"
label2="背景亮度"
label4="图标亮度"
label7="背景色滤除强度"
checkBox_show0="是否显示无效0"

comboBox1String_1 =  "透明"
comboBox1String_2 =  "显示背景"
comboBox3String_1 =  "整数（2字节）"
comboBox3String_2 =  "长整数（4字节）"
comboBox3String_3 =  "*VP高字节"
comboBox3String_4 =  "*VP低字节"
comboBox3String_5 =  "超长整数（8字节）"
comboBox3String_6 =  "无符号整数（2字节）"
comboBox3String_7 =  "无符号长整数（4字节）"
comboBox3String_8 =  "单精度浮点数（4字节）"
comboBox3String_9 =  "双精度浮点数（8字节）"
comboBox2String_1 =  "左对齐"
comboBox2String_2 =  "右对齐"
comboBox2String_3 =  "居中"
cb4_item0="覆盖背景图片"
cb4_item1="背景图片叠加模式 1"
cb4_item2="背景图片叠加模式 2"

//图片动画显示
[ImgAnimate]
label2  =  "描述指针(0x)"
label3  =  "显示时间设置"
label6  =  "起始图片位置"
label5  =  "终止图片位置"
label16  =  "名称定义"
TabText  =  "图片动画显示"
button5="指定"
label7="图片库位置"
label19="结束后返回页面:"
myGroupBox1="图片库位置(0x00:SD 卡配置值)"

//图标旋转指示
[ICONRotate]
label6  =  "屏幕旋转中心，系统自动默认为配置按钮的左上坐标"
label17  =  "旋转角度，0-720（0x000-0x2D0），单位0.5°"
button2  =  "旋转演示"
label13  =  "终止旋转角度"
label14  =  "起始旋转角度"
label9  =  "终止旋转角度变量值"
label12  =  "起始旋转角度变量值"
label2  =  "变量地址(0x)"
label15  =  "描述指针(0x)"
label4  =  "图标ID"
label7  =  "图标文件"
label16  =  "名称定义"
label19  =  "初始值"
TabText  =  "图标旋转指示"
label3 = "图标旋转中心："
label8 = "显示模式"
label5="背景色滤除强度"

comboBox1String_1 =  "透明"
comboBox1String_2 =  "显示背景"
comboBox2String_1 =  "指向整型变量"
comboBox2String_2 =  "指向高字节数据"
comboBox2String_3 =  "指向低字节数据"


//位变量图标显示
[bitIconForm]
button3  =  "设置"
label15  =  "显示模式"
label14  =  "移动间隔"
label11  =  "移动模式"
label8  =  "显示模式"
label7  =  "图标文件"
label10  =  "辅助地址(0x)"
label16  =  "名称定义"
label2  =  "变量地址(0x)"
label1  =  "描述指针(0x)"
label4  =  "初始值"
Text  =  "位变量图标显示"
label18="背景色滤除强度"
comboBox3String_1 =  "透明"
comboBox3String_2 =  "显示背景"

//位控制设置
[ActBitSetForm]
button1 = "确定"
button2 = "取消"
Text = "位控制设置"


//数据变量显示"
[DataVarForm]
label14  =  "单位字符串，ASCII编码"
label3  =  "显示单位 "
label13  =  "小数位数"
label9  =  "整数位数"
label12  =  "变量类型"
label11  =  "字体大小"
label15  =  "字库位置"
label7  =  "显示颜色"
label8  =  "变量单位长度"
label10  =  "对齐方式"
label2  =  "变量地址(0x)"
label4  =  "描述指针(0x)"
label16  =  "名称定义"
label17  =  "初始值"
TabText  =  "数据变量显示"
Text  =  "数据变量显示"
checkBox1="字符间距自动调整"
checkBox2="无效零显示"
cbox_popshow="在弹出菜单中显示"

comboBox1String_1 =  "左对齐"
comboBox1String_2 =  "右对齐"
comboBox1String_3 =  "居中"
Cb_vartypeString_1 =  "整数（2字节）"
Cb_vartypeString_2 =  "长整数（4字节）"
Cb_vartypeString_3 =  "*VP高字节"
Cb_vartypeString_4 =  "*VP低字节"
Cb_vartypeString_5 =  "超长整数（8字节）"
Cb_vartypeString_6 =  "无符号整数（2字节）"
Cb_vartypeString_7 =  "无符号长整数（4字节）"
Cb_vartypeString_8 =  "单精度浮点数（4字节）"
Cb_vartypeString_9 =  "双精度浮点数（8字节）"


//文本显示
[TextdisForm]
label3  =  "显示颜色(0x)"
label12  =  "编码方式"
label6  =  "编码方式为0x01-0x04时ASCII字库位置"
label10  =  "编码方式为0x00,0x05,以及0x01\r\n-0x04的非ASCII字符使用的字库"
checkBox1  =  "字符间距自动调整"
label14  =  "文本长度"
label13  =  "垂直间隔"
label18  =  "水平间隔"
label9  =  "Y方向点阵数"
label11  =  "X方向点阵数"
label16  =  "名称定义"
label7  =  "描述指针(0x)"
label2  =  "变量地址(0x)"
label17  =  "初始值"
Text  =  "文本显示"

cb_adjust="字符间距自动调整"
label19="水平对齐"
label20="垂直对齐"
cbox_popshow="在弹出菜单中显示"

Cb_vartypeString_1 =  "0x00=8bit编码"
Cb_vartypeString_2 =  "0x01=GB2312内码"
Cb_vartypeString_3 =  "0x02=GBK"
Cb_vartypeString_4 =  "0x03=BIG5"
Cb_vartypeString_5 =  "0x04=SJIS"
Cb_vartypeString_6 =  "0x05=UNICODE"

cb1_item0="上对齐"
cb1_item1="居中"

cb2_item0="左对齐"
cb2_item1="右对齐"
cb2_item2="居中"
cb2_item3="从右向左显示"

[DGUSTextdisForm]
label3  =  "显示颜色(0x)"
label12  =  "编码方式"
label6  =  "编码方式为0x01-0x04时ASCII字库位置"
label10  =  "编码方式为0x00,0x05,以及0x01\r\n-0x04的非ASCII字符使用的字库"
checkBox1  =  "字符间距自动调整"
label14  =  "文本长度"
label13  =  "垂直间隔"
label18  =  "水平间隔"
label9  =  "对齐方式"
label11  =  "X方向点阵数"
label16  =  "名称定义"
label7  =  "描述指针(0x)"
label2  =  "变量地址(0x)"
label17  =  "初始值"
Text  =  "文本显示"

cb_adjust="字符间距不自动调整"
label19="文字缩放比例"
label20="垂直对齐"
cbox_popshow="在弹出菜单中显示"

Cb_vartypeString_1 =  "0x00=8bit编码"
Cb_vartypeString_2 =  "0x01=GB2312内码"
Cb_vartypeString_3 =  "0x02=GBK"
Cb_vartypeString_4 =  "0x03=BIG5"
Cb_vartypeString_5 =  "0x04=SJIS"
Cb_vartypeString_6 =  "0x05=UNICODE"

cb2_item0="左对齐"
cb2_item1="右对齐"
cb2_item2="居中"

//表盘时钟设置
[ClockDis]
checkBox1  =  "不显示时针" 
label3  =  "时针图标"           
label11  =  "时针中心坐标"
label6  =  "分针图标"
label5  =  "分针中心坐标"
checkBox2  =  "不显示分针"
label12  =  "秒针图标"
label9  =  "秒针中心坐标"
checkBox3  =  "不显示秒针"
label7  =  "图标文件"
label2  =  "时钟表盘的指针中心位置\r\n为坐标的左上角"
label4  =  "描述指针(0x)"
label16  =  "名称定义"
Text =  "表盘时钟设置"


//RTC显示
[RTCDISForm]
checkBox1  =  "显示星期"
label2  =  "日期格式："
label12  =  "RTC编码表："
label18  =  "使用RTC编码表和ASCII字符构成"
label28  =  "Q"
label29  =  "公历_分钟"
label26  =  "H"
label27  =  "公历_小时"
label24  =  "D"
label25  =  "公历_日"
label23  =  "公历_月"
label22  =  "M"
label20  =  "Y"
label21  =  "公历_年"
label19  =  "编码"
label8  =  "-      说明"
label32  =  "W"
label33  =  "公历_星期"
label30  =  "S"
label31  =  "公历_秒"
label6  =  "M-D W H:Q 将显示为"
label7  =  "2012-05-02  12:00:00"
label14  =  "Y-M-D H:Q:S 将显示为"
label13  =  "2012-05-02 12:00:00 星期三"
label10  =  "05-02 WED 12：00"
label9  =  "假设当前时间是:"
label1  =  "描述指针(SP)"
label4  =  "描述指针(0x)"
label11  =  "X方向点阵数"
label15  =  "字库位置"
label3  =  "字体颜色"
label16  =  "名称定义"
Text  =  "RTC显示"
checkBox2="字符间距自动调整"
//基本图形显示
[BaseGraphs]
label4  =  "变量地址(0x)"
label5  =  "描述指针(0x)"
label16  =  "名称定义"
label8  =  "使用线段的绘图指令 ： 0x02,0x03,0x09,0x0A\r\n将使用虚线或者点划线显示线段"
checkBox1  =  "虚线/点划线"
groupBox1  =  "设置虚线（点划线）格式"
TabText  =  "基本图形显示"


//特殊行业应用
[BaseApplyForm]
label2 = "变量地址(0x)"
label3 = "描述指针(0x)"
label16 = "名称定义"
TabText = "特殊行业应用"

//二维码
[QRCodeForm]
label8  =  "Unit_Pixels"
label2  =  "变量地址(0x)"
label4  =  "描述指针(0x)"
label16  =  "名称定义"
Text  =  "二维码"

label12="显示模式"
label3="显示颜色"
label5="背景颜色"
label6="二维码颜色"

cb1_item0="黑白色"
cb1_item1="自定义"
cb2_item0="自动匹配大小"
cb2_item1="固定73*73"

//区域滚屏显示
[ZonescrollingForm]
label1  =  "描述指针(SP)"      
label5  =  "移动方式"           
groupBox1  =  "滚动速度"           
label8  =  "单周期平移距离（像素）"
label2  =  "变量数据(0x)"
label4  =  "描述指针(0x)"
label16  =  "名称定义"
TabText  =  "区域滚屏显示"
comboBox2String_1 =  "左移"  
comboBox2String_2 =  "右移"
comboBox2String_3  =  "上移"
comboBox2String_4 =  "下移"

//数据窗口指示
[DataWindowForm]
groupBox1  =  "显示模式"  
checkBox3  =  "数据越界后掉头"
checkBox2  =  "显示正数+号"
checkBox1  =  "显示无效0"
label8  =  "调节步长"
label6  =  "显示数据总个数"
label4  =  "整数位数"
label5  =  "小数位数"
label1  =  "数据上限"
label11  =  "数据下限"
label16  =  "名称定义"
label7  =  "描述指针(0x)"
label2  =  "变量地址(0x)"
groupBox2  =  "数据特征"
groupBox4  =  "选中数据"
label12  =  "Y方向点大小" 
label13  =  "X方向点大小"
label14  =  "显示颜色(0x)"
groupBox3  =  "未选中数据"
label10  =  "Y方向点大小"
label9  =  "X方向点大小"
label3  =  "显示颜色(0x)"
Text  =  "数据窗口指示"
checkBox4="字符间距自动调整"
label15="字库位置"
//预览窗口
[PreviewForm]
label2 = "鼠标左键双击四边框，退出预览"
label1="虚拟串口"
label5="串口"
label6="波特率"
btnOpen="打开"
btnFrmCom="通信记录"
btnComSet="串口设置"
btnDebug="调试"

//变量数据录入
[DGUSForm]
Dis_Pass  =  "输入时显示为 *"
label10  =  "显示位置"
label9  =  "键盘区域"
label8  =  "所在页面"
button1  =  "设置"
button22  =  "键盘设置"
label16  =  "名称"
checkBox2  =  "无按钮效果"
button5  =  "指定"
label19  =  "按钮效果："
checkBox1  =  "启用范围限制"
label20  =  "上限"
label17  =  "下限"
checkBox3  =  "数据自动上传"
checkNext  =  "不进行页面切换"
label21  =  "页面切换："
button6  =  "指定"
checkBox4  =  "录入过程中加载数据"
label26  =  "加载数据"
label25  =  "数据地址(0x)"
label13  =  "小数位数"
label22  =  "键盘位置"
label2  =  "输入显示方式"
label15  =  "光标颜色"
label1  =  "整数位数"
label7  =  "字体大小"
label6  =  "字库位置"
label5  =  "显示颜色"
label4  =  "显示位置"
label3  =  "变量类型"
label11  =  "变量地址(0x)"
label23  =  "初始值"
TabText  =  "变量数据录入"
Text  =  "变量数据录入"
label24="背景透明度"
Cb_vartypeString_1 =  "整数（字）"
Cb_vartypeString_2 =  "长整数（双字）"
Cb_vartypeString_3 =  "变量指针高字节"
Cb_vartypeString_4 =  "变量指针低字节"
Cb_vartypeString_5 =  "超长整数（8字节）"
Cb_vartypeString_6 =  "浮点数"
Cur_ColorString_1 =  "黑色"
Cur_ColorString_2 =  "白色"
comboBox1String_1 =  "显示 \'*\'"
comboBox1String_2 =  "直接显示"
comboPostioString_1 =  "当前页面"
comboPostioString_2 =  "其他页面"
comboPostioString_3 =  "组态键盘"


//弹出菜单配置
[PopMenuForm]
label11  =  "变量地址(0x)"
label3  =  "变量类型"
button1  =  "设置"
label10  =  "显示位置"
label9  =  "菜单区域"
button22  =  "弹出菜单设置"
label8  =  "所在页面"
label16  =  "名称定义"
checkBox2  =  "无按钮效果"
label19  =  "按钮效果："
button5  =  "指定"
checkBox3  =  "数据自动上传"
label6  =  "写入位0x"
radioButton4  =  "位控制"
radioButton3  =  "写入低字节"
radioButton2  =  "写入高字节"
radioButton1  =  "按字写入变量"
Text  =  "弹出菜单配置"
label1="背景透明度"
//增量调节
[IncAdjustForm]
label11  =  "变量地址(0x)"
label3  =  "变量类型"
label16  =  "名称"
checkBox2  =  "无按钮效果"
label19  =  "按钮效果："
button5  =  "指定"
checkBox3  =  "数据自动上传"
label6  =  "写入位(0x)"
radioButton4  =  "位控制"
radioButton3  =  "写入低字节"
radioButton2  =  "写入高字节"
radioButton1  =  "按字写入变量"
label9  =  "上限"
label10  =  "下限"
label5  =  "逾限处理方式"
label4  =  "调节步长"
label1  =  "调节方式" 
label7  =  "延时时间(100ms)"
label8  =  "按键效果"
TabText  =  "增量调节"
Cb_vartypeString_1 =  "按字调节"
Cb_vartypeString_2 =  "调节高字节"
Cb_vartypeString_3 =  "调节低字节"
comboBox2String_1 =  "停止（等于门限）"
comboBox2String_2 =  "循环调节"
comboBox3String_1 =  "按住键时连续调节"
comboBox3String_2 =  "按住键时只调节一次"


//拖动调节
[DragManagerForm]
groupBox1  =  "拖动方式"
label1  =  "数据返回格式"
label5  =  "拖动方式"
checkBox3  =  "数据自动上传"
label9  =  "终止位置对应的返回值"
label10  =  "起始位置对应的返回值"
label16  =  "名称定义"
label11  =  "变量地址(0x)"
label17  =  "初始值"
TabText  =  "拖动调节"
comboBox1String_1 =  "调节字地址"
comboBox1String_2 =  "调节高字节"
comboBox1String_3 =  "调节低字节"
comboBox2String_1 =  "横向拖动"
comboBox2String_2 =  "纵向拖动"

//滑动图标选择
[PageDragManagerForm]
TabText = "滑动图标选择";
groupBox1 = "移动方式";
label3="注意：此控件大小应与对应的图标页面平移控件一致"
label5 = "移动方式";
label9 = "滑动速度";
label10 = "移动界面ID";
label11 = "变量地址(0x)";
label16 = "名称定义";
checkBox3="数据自动上传"
comboBox2String_1 =  "横向滑动"
comboBox2String_2 =  "纵向滑动"

//按键值返回配置
[TouchReturnForm]
button1 = "指定"
button5 = "指定"
label11  =  "变量地址(0x)"
label16  =  "名称定义"
label5  =  "返回值保存方式"
label19  =  "按钮效果："
checkBox2  =  "无按钮效果"
checkBox1  =  "不进行页面切换"
label1  =  "页面切换："
groupBox3  =  "键值(0x)"
checkBox5  =  "完全按键定义"
label6  =  "写入位0x"
radioButton4  =  "位控制"
radioButton3  =  "写入低字节"
radioButton2  =  "写入高字节"
radioButton1  =  "按字写入变量"
checkBox3  =  "基本触控"
checkBox4  =  "数据自动上传"
Text  =  "按键值返回配置"
label3 = "提示:\r\n\"基本触控\" 选择完全按键定义,\r\n请点击\"设置 \"按钮进行定义\r\n\r\n\r\n\"基本触控\" 如果使用数字按键,\r\n请按如下键值进行定义:\r\n0x0030-0x0039 (0-9), \r\n0x002E(.),\r\n0x002D(+/-),\r\n0x00F0(Cancel),\r\n0x00F1(Confirm/OK),\r\n0x00F2(Backspace)." 
label4="按压时间(单位：0.1s)："

//ASCII录入
[TextInputForm]
label4  =  "录入显示区域"
button1  =  "设置"
label10  =  "显示位置"
label9  =  "键盘区域"
button22  =  "键盘设置"
label8  =  "所在页面"
label16  =  "名称定义"
button3  =  "设置"
checkBox2  =  "无按钮效果"
button5  =  "指定"
label19  =  "按钮效果："
checkBox3  =  "数据自动上传"
checkBox1  =  "输入状态返回"
checkNext  =  "不进行页面切换"
label17  =  "页面切换："
button6  =  "指定"
label22  =  "键盘位置"
label20  =  "Y方向点阵数"
label3  =  "录入模式"
label15  =  "光标颜色"
label1  =  "文本长度"
label7  =  "X方向点阵数"
label6  =  "字库位置"
label5  =  "文本颜色"
label11  =  "变量地址(0x)"
label2  =  "输入过程显示方式"
Text  =  "ASCII录入"
label24  =  "背景透明度"
label21  =  "初始值"
Cur_ColorString_1 =  "黑色"
Cur_ColorString_2 =  "白色"
comboBox1String_1 =  "正常显示"
comboBox1String_2 =  "显示(*),密码输入方式"
comboBox2String_1 =  "重新录入"
comboBox2String_2 =  "修改文本"
comboPostionString_1 =  "当前页"
comboPostionString_2 =  "其他页"

//参数配置
[ParamConfigForm]
button1 = "指定"
button5 = "指定"
label16  =  "名称定义"
label19  =  "按钮效果："
checkBox2  =  "无按钮效果"
checkBox1  =  "不进行页面切换"
label1  =  "页面切换："
checkBox4  =  "数据自动上传"
Text  =  "参数配置"

//同步数据返回
[K_DO_RETForm]
label16  =  "名称定义"
checkBox2  =  "无按钮效果"
label19  =  "按钮效果："
button5  =  "指定"
groupBox5  =  "松开按压"
label12  =  "数据长度"
label15  =  "模式"
groupBox4  =  "持续按压"
label8  =  "数据长度"
label11  =  "模式"
groupBox3  =  "第一次按压"
label7  =  "数据长度"
label4  =  "模式"
checkNext  =  "不进行页面切换"
label1  =  "页面切换："
button1  =  "指定"
Text  =  "同步数据返回"



//转动调节
[RotateadjustForm]
label16  =  "名称定义"
checkBox2  =  "无按钮效果"
label19  =  "按钮效果："
button5  =  "指定"
label12  =  "对应返回值"
label11  =  "对应返回值"
label9  =  "A1(终止角度)"
label10  =  "A0(起始角度)"
label8  =  "R1(区域外径)"
label7  =  "圆心坐标"
label5  =  "R0(区域内径)"
label6  =  "变量地址(0x)"
label4  =  "调节数据格式"
checkNext  =  "不进行页面切换"
label1  =  "页面切换："
button1  =  "指定"
button3  =  "设置"
Text  =  "转动调节"
comboBox1String_1 =  "0x00 （整数）"
comboBox1String_2 =  "0x01 （高字节）"
comboBox1String_3 =  "0x02 （低字节）"


//滑动手势调节
[SwipeAdjustForm]
label5  =  "滑动方式"
label16  =  "名称定义"
label11  =  "变量地址(0x)"
label17  =  "灵敏度（1为最高灵敏度）"
checkBox3  =  "数据自动上传"
label2  =  "有效调节区域"
TabText  =  "滑动手势调节"
comboBox2String_1 =  "横向滑动"
comboBox2String_2 =  "纵向滑动"


//滑动手势翻页
[SwipePageForm]
checkBox1  =  "无后一页"
label1  =  "后一页："   
button1  =  "指定"       
checkBox2  =  "无前一页"
label19  =  "前一页："
button5  =  "指定"
label16  =  "名称定义"
label11  =  "变量地址(0x)"
label17  =  "时间"  
checkBox3  =  "数据自动上传"
groupBox3  =  "翻页灵敏度（距离/时间）"
label3  =  "距离"
label2  =  "有效调节区域"
TabText  =  "滑动手势翻页"
label4 = "页面编号是否自动上传"
myGroupBox1="结束动画设置"
label6="结束动画速度"
label5="说明：\r\n 0x00:结束无动画;\r\n其他值:单位为像素点除以DGUS周期，推荐值为水平分辨率除以20 "
label7="滑动模式"
cbox1_item0="水平"
cbox1_item1="垂直"

//迪文ICO文件预览
[frm_ICON_Sel]
toolStripButton1  =  "打开"
tbrname  =  "重新编号"
toolStripButton2  =  "上一页"
toolStripButton3  =  "下一页"
toolStripButton4 =  "生成ICO"
toolStripLabel1  =  "ICO文件像素选择"
LabToICO  =  "路径："
tabPage1  =  "ICO文件生成"
label4  =  "文件路径："
grbDataSetting  =  " 图片大小设定"
toolStripDropDownButton2  =  "设置"
设置选择项ToolStripMenuItem  =  "设置选择项"
设置所有ToolStripMenuItem  =  "设置所有"
radioButton1  =  "按文件名编号"
lblWidth  =  "宽："
lblHeight  =  "高："
radioButton2  =  "按文件顺序自动编号"
label6  =  "提示："
label5  =  "  如需要修改或追加\r\n图片到ICO文件中,请\r\n重复第一步和第二步"
label3  =  "或  者"
label2  =  "第二步："
button6  =  "选择图片文件路径"
button5  =  "添加到ICO文件"
button1  =  "生成新ICO文件"
label1  =  "第一步 ："
textBox1  =  "支持的文件格式有： \"ICO\", \"JPG\", \"BMP\", \"GIF\", \"PNG\"\r\n------------------------\r\n如果图片尺寸大于1023统一转换为1023*1023大小" 
位置  =  "位置"
Column1  =  "文件名"
Column2  =  "分辨率"
tabPage2  =  "ICO文件预览"
button8  =  "取消"
button7  =  "确定"
checkBox1  =  "是否过滤背景色"
button2  =  "打开文件"
button3  =  "上一页"
button4  =  "下一页"
dataGridViewTextBoxColumn1  =  "位置"
dataGridViewTextBoxColumn2  =  "文件名"
dataGridViewTextBoxColumn3  =  "分辨率"
Text  =  "迪文ICO文件预览"



//图片预览
[imgview]
button1  =  "确定"
button2  =  "取消"
Text  =  "图片预览"


//查看地址设置
[PageSetForm]
label1 =  "当前页面 ："
tabPage1 =  "变量地址查看"
Text  =  "查看地址设置"


//显示区域
[TDocumentSpaceForm]
label2 =  "段数"
checkBox2 =  "语音 ID"
label1 =  "键值(0x)"
checkBox1 =  "键控"
checkBox3 =  "锁定"
String_1 =  "打开出错，请导入配置文件，以还原配置文件"
String_2 =  "动画显示设置"
String_3 =  "图标变量"
String_4 =  "基础触控"
String_5 =  "DGUS Tool 工程路径: "
String_6 =  "文件 DWHMI (*.hmi)|*.hmi"
String_7 =  "是否关闭工程? 选择'是', 则会丢失修改的内容"
String_8 =  "提示"
String_9 =  "在工程目录下的 [DWIN_SET] 中未找到字库文件，请将字库文件拷贝到[DWIN_SET]中"
String_10 =  "加载成功"
String_11 =  "保存成功"
String_12 =  "生成完成，文件名为： HMIConfig.bin，存放当前工程目录下"
String_13 =  "没有需要生成触控配置的设置"
String_14 =  "确定删除选中的图片?"
String_15 =  "确定删除所有图片?"
String_16 =  "已经是第一行了"
String_17 =  "已经是最后一行了"
String_18 =  "请先增加图片！"
String_19 =  "请选择一个路径！"
String_20 =  " 图片 {0} 和 图片 {1},文件名重复， 请重新命名."
String_21 =  "配置文件生成成功!"
String_22 =  "生成失败, 请检测变量配置数量是否大于： "
String_23 =  "生成失败, DWINSET 目录是否只读"
String_24 =  "生成失败!"
String_25 =  "图片 [ "
String_26 =  " ] 按钮配置有交叉. 请检测并重试."
String_27 =  " 第 {0} 页，变量地址或初始值设置错误，请检测"
String_28 =  "导出错误，请关闭 Excel 并重试 "
String_29 =  "导出完成！"
String_30 =  "未找到13配置文件，请重新选择路径!"
String_31 =  "未找到14配置文件，请重新选择路径!"
String_32 =  "请先打开或者创建工程！"
String_33 =  "没有可预览的图片，请在图片设置中添加图片后进行预览"
String_34 =  "将工程保存到一个新目录下，保存方式分为正常保存和偏转90度保存\r\n \r\n 1、选择“是”，将工程按现有方式保存到新目录下\r\n 2、选择“否”，将工程下的图片按90度偏转后保存到新目录下\r\n\r\n  另存过程花费时间比较长，请耐心等待..."
String_35 =  "画面"
String_36 =  "与"
String_37 =  "画面的描述指针冲突!"
String_38 =  "自定义提示"
String_39 =  ""
String_40 =  ""
String_41 =  ""
String_42 =  ""
String_43 =  ""
String_44 =  ""
String_45 =  ""
String_46 =  ""
String_47 =  ""
String_48 =  ""
String_49 =  ""
String_50 =  ""



//图标变量批量设置
[cfg_ICOvarForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "变量上下限值按顺序自动递增--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "对应的图标ID 自动根据上下限联动变化"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
checkBox5 =  "描述指针按顺序增加--"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "图标变量批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "图标文件"
String_10 =  "变量下限"
String_11 =  "下限对应的图标"
String_12 =  "变量上限"
String_13 =  "上限对应的图标"
String_14 =  "显示模式"
String_15 =  "透明"
String_16 =  "显示背景"
String_17 =  "初始值"

//ASCII录入批量设置
[cfg_AsciiInputForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox2  =  "变量地址按顺序增加--"
checkBox3  =  "显示颜色"
button3  =  "指定基准"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "ASCII 录入"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "ASCII录入批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "按钮效果"
String_9 =  "页面切换"
String_10 =  "文本长度"
String_11 =  "录入模式"
String_12 =  "重新录入"
String_13 =  "修改文本"
String_14 =  "字库位置"
String_15 =  "X方向点阵数"
String_16 =  "Y方向点阵数"
String_17 =  "光标颜色"
String_18 =  "黑色"
String_19 =  "白色"
String_20 =  "输入状态返回"
String_21 =  "录入显示区域"
String_22 =  "录入显示方式"
String_23 =  "正常显示"
String_24 =  "显示(*),密码输入方式"
String_25 =  "键盘位置"
String_26 =  "当前页"
String_27 =  "其他页"
String_28 =  "弹出菜单"
String_29 =  "页面"
String_30 =  "菜单区域"
String_31 =  "设置"
String_32 =  "显示位置"


//基本触控批量设置
[cfg_BaseTouchForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox4  =  "按键值按顺序增加  --"
button3  =  "指定基准2"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "基本触控"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "基本触控批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "按钮效果"
String_6 =  "页面切换"
String_7 =  "键值设置"
String_8 =  "0000"



//二维码批量设置
[cfg_DimensionForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
button3  =  "指定基准"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "二维码设置"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "二维码批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "整数位数"

//数据显示量设置
[cfg_DisDataForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox4  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox3  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "数据显示"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "数据显示批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "字库位置"
String_10 =  "字体大小"
String_11 =  "对齐方式"
String_12 =  "左对齐"
String_13 =  "右对齐"
String_14 =  "居中"
String_15 =  "变量类型"
String_16 =  "0X00=整数（字）"
String_17 =  "0X01=长整数（双字）"
String_18 =  "0X02=变量指针高字节"
String_19 =  "0X03=变量指针低字节"
String_20 =  "0X04=超长整数(8字节)"
String_21 =  "0X05=无符号整数（2字节）"
String_22 =  "0X06=无符号整数（4字节）"
String_27 =  "0X07=浮点数"
String_28 =  "0X08=双精度"
String_23 =  "整数位数"
String_24 =  "小数位数"
String_25 =  "显示单位"
String_26 =  "初始值"

//文本显示批量设置
[cfg_DisTextForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox4  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox3  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "数据显示"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "数据显示量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "编码方式"
String_10 =  "0x00=8bit编码"
String_11 =  "0x01=GB2312内码"
String_12 =  "0x02=GBK"
String_13 =  "0x03=BIG5"
String_14 =  "0x04=SJIS"
String_15 =  "0x05=UNICODE"
String_16 =  "字符间距自动调整"
String_17 =  "文本长度"
String_18 =  "FONT0ID"
String_19 =  "编码方式为0x01-0x04时ASCII字库位置"
String_20 =  "FONT1ID"
String_21 =  "非ASCII字符使用的字库位置"
String_22 =  "X方向点阵数"
String_23 =  "Y方向点阵数"
String_24 =  "水平间隔"
String_25 =  "垂直间隔"
String_26 =  "初始值"
String_27 =  "迪文科技"

String_28 =  "水平对齐"
String_29="左对齐"
String_30="右对齐"
String_31="居中"
String_32="从右向左显示"

String_33 =  "垂直对齐"
String_34="上对齐"
String_35="居中"

//动画图标批量设置
[cfg_ICOAnimForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "动画图标"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "动画图标批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "图标文件"
String_10 =  "停止值"
String_11 =  "开始值"
String_12 =  "停止图标"
String_13 =  "开始图标"
String_14 =  "结束图标"
String_15 =  "显示模式"
String_16 =  "透明"
String_17 =  "显示背景"
String_18 =  "初始值"

//艺术字显示批量设置
[cfg_ICOArtForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "艺术字显示"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "艺术字显示批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "图标文件"
String_10 =  "起始图标"
String_11 =  "显示模式"
String_12 =  "透明"
String_13 =  "显示背景"
String_14 =  "变量类型"
String_15 =  "整数（2字节）"
String_16 =  "长整数（4字节）"
String_17 =  "*VP高字节"
String_18 =  "*VP低字节"
String_19 =  "超长整数（8字节）"
String_20 =  "无符号整数（2字节）"
String_21 =  "无符号长整数（4字节）6
String_22 =  "整数位数"
String_23 =  "小数位数"
String_24 =  "对齐方式"
String_25 =  "左对齐"
String_26 =  "右对齐"
String_27 =  "初始值"
String_28 =  "单精度浮点数"
String_29 =  "双精度浮点数"

//位变量图标批量设置
[cfg_ICOBitForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "位变量图标"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "位变量图标批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "显示模式"
String_10 =  "移动模式"
String_11 =  "移动间隔"
String_12 =  "位控制设置"
String_13 =  "0000"
String_14 =  "图标文件"
String_15 =  "显示背景"
String_16 =  "透明"
String_17 =  "显示背景"
String_18 =  "辅助变量地址"
String_19 =  "0000"
String_20 =  "初始值"

//图片旋转批量设置
[cfg_ICORotationForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "图片旋转"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "图片旋转批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "图标文件"
String_10 =  "图标ID"
String_11 =  "旋转中心"
String_12 =  "起始旋转角度变量值"
String_13 =  "终止旋转角度变量值"
String_14 =  "起始旋转角度"
String_15 =  "终止旋转角度"
String_16 =  "显示模式"
String_17 =  "透明"
String_18 =  "显示背景"
String_19 =  "变量类型"
String_20 =  "指向整型变量"
String_21 =  "指向高字节数据"
String_22 =  "指向低字节数据"
String_23 =  "初始值"

//滑动刻度批量设置
[cfg_ICOSliderForm]
checkBox1  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "描述指针按顺序增加--"
checkBox2  =  "变量地址按顺序增加--"
checkBox4  =  "显示颜色"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
label4  =  "滑动刻度"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "滑动刻度批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "描述指针"
String_6 =  "0000"
String_7 =  "变量地址"
String_8 =  "0000"
String_9 =  "图标文件"
String_10 =  "起始变量刻度值"
String_11 =  "终止变量刻度值"
String_12 =  "滑动图标"
String_13 =  "刻度模式"
String_14 =  "横向刻度条"
String_15 =  "纵向刻度条"
String_16 =  "坐标前移偏移量"
String_17 =  "显示模式"
String_18 =  "透明"
String_19 =  "显示背景"
String_20 =  "变量类型"
String_21 =  "指向整型变量"
String_22 =  "指向高字节数据"
String_23 =  "指向低字节数据"
String_24 =  "初始值"


//增量调节批量设置
[cfg_IncAdjustmentForm]
checkBox4  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox1  =  "写入位按列表顺序增加"
checkBox2  =  "变量地址按顺序增加--"
label6  =  "写入位0x"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
radioButton4 =  "位控制"
radioButton3 =  "写入低字节"
radioButton2 =  "写入高字节"
radioButton1 =  "按字写入变量"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "增量调节批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "按钮效果"
String_9 =  "调节方式"
String_10 =  "逾限处理方式"
String_11 =  "停止（等于门限)"
String_12 =  "循环调节"
String_13 =  "调节步长"
String_14 =  "上限"
String_15 =  "下限"
String_16 =  "按键效果"
String_17 =  "按住键时连续调节"
String_18 =  "按住键时只调节一次"





//弹出菜单批量设置
[cfg_PopMenuForm]
checkBox4  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox1  =  "写入位按列表顺序增加"
checkBox2  =  "变量地址按顺序增加--"
label6  =  "写入位0x"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
radioButton4 =  "位控制"
radioButton3 =  "写入低字节"
radioButton2 =  "写入高字节"
radioButton1 =  "按字写入变量"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "弹出菜单批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "按钮效果"
String_9 =  "弹出菜单"
String_10 =  "页面"
String_11 =  "菜单区域"
String_12 =  "设置"
String_13 =  "显示位置"


//按键返回批量设置
[cfg_ReKeyForm]
checkBox5  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox1  =  "写入位按列表顺序增加"
checkBox2  =  "变量地址按顺序增加--"
label6  =  "写入位0x"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
radioButton4 =  "位控制"
radioButton3 =  "写入低字节"
radioButton2 =  "写入高字节"
radioButton1 =  "按字写入变量"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "按键返回批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "按钮效果"
String_9 =  "页面切换"
String_10 =  "键值设置"
String_11 =  "0000"


//拖动调节批量设置
[cfg_SliderAdjustForm]
checkBox5  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox1  =  "写入位按列表顺序增加"
checkBox2  =  "变量地址按顺序增加--"
label6  =  "写入位0x"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
radioButton4 =  "位控制"
radioButton3 =  "写入低字节"
radioButton2 =  "写入高字节"
radioButton1 =  "按字写入变量"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "拖动调节批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "起始位置返回值"
String_9 =  "终止位置返回值"
String_10 =  "拖动方式设置"
String_11 =  "数据返回格式"
String_12 =  "调节字地址"
String_13 =  "调节高字节"
String_14 =  "调节低字节"
String_15 =  "方式"
String_16 =  "横向拖动"
String_17 =  "纵向拖动"


//变量数据录入批量设置
[cfg_VarinputForm]
checkBox5  =  "全选"
toolStripButton1  =  "上移"
toolStripButton2  =  "下移"
toolStripButton3  =  "删除"
toolStripButton4  =  "刷新--回到选中状态"
checkBox3  =  "显示颜色"
checkBox2  =  "变量地址按顺序增加--"
label6  =  "写入位0x"
label8  =  "操作方法：\r\n1、双击列表，可以修改触控按钮名称,按回车键确认修改\r\n2、选中列表时在设计界面上可对应选中，以便用户对应参考\r\n3、点击【批量修改】按钮，使属性栏中打钩选项的属性一致\r\n4、点击上下移动按钮，可改变列表中的顺序，设置时按列表顺序执行"
radioButton4 =  "位控制"
radioButton3 =  "写入低字节"
radioButton2 =  "写入高字节"
radioButton1 =  "按字写入变量"
button2  =  "退  出"
button1  =  "批量修改"
Text  =  "变量数据录入批量设置"
String_1 =  "基础属性设置"
String_2 =  "是否变化"
String_3 =  "属性名称"
String_4 =  "属性设置"
String_5 =  "数据自动上传"
String_6 =  "变量地址"
String_7 =  "0000"
String_8 =  "按钮效果"
String_9 =  "图片切换"
String_10 =  "变量类型"
String_11 =  "0X00=整数（字）"
String_12 =  "0X01=长整数（双字）"
String_13 =  "0X02=变量指针高字节"
String_14 =  "0X03=变量指针低字节"
String_15 =  "0X04=超长整数(8字节)"
String_16 =  "整数位数"
String_17 =  "小数位数"
String_18 =  "录入显示区域"
String_19 =  "字库位置"
String_20 =  "字体大小"
String_21 =  "光标颜色"
String_22 =  "黑色"
String_23 =  "白色"
String_24 =  "输入显示方式"
String_25 =  "显示'*'"
String_26 =  "直接显示"
String_27 =  "键盘位置"
String_28 =  "当前页"
String_29 =  "其他页"
String_30 =  "弹出菜单"
String_31 =  "页面"
String_32 =  "菜单区域"
String_33 =  "设置"
String_34 =  "显示位置"
String_35 =  "启用范围限制"
String_36 =  "上限"
String_37 =  "下限"
String_38 =  "录入过程加载数据"
String_39 =  "加载地址"
String_40 =  "0000"
String_41 =  "加载数据"




//
[]


